---
kind: property
id: P:Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.SystemsAnalysisWorkflowFile
source: html/afa99f32-2a4f-94bc-d06a-164df200e060.htm
---
# Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.SystemsAnalysisWorkflowFile Property

The full path name of the original system analysis workflow file.

## Syntax (C#)
```csharp
public string SystemsAnalysisWorkflowFile { get; }
```